ExampleInput/channelFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

L   4;
H1   1;
H2   2;
B   4;

nL  40;
nH  25;
nB  60;

vertices
(
    (0 0 0)
    ($L 0 0)
    (0 $H1 0)
    ($L $H1 0)
    (0 $H2 0)
    ($L $H2 0)

    (0 0 $B)
    ($L 0 $B)
    (0 $H1 $B)
    ($L $H1 $B)
    (0 $H2 $B)
    ($L $H2 $B)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) ($nL $nH $nB) simpleGrading (1 10.7028 1)
    hex (2 3 5 4 8 9 11 10) ($nL $nH $nB) simpleGrading (1 0.0934 1)
);

edges
(
);

boundary
(
    bottomWall
    {
        type            wall;
        faces           ((0 1 7 6));
    }

    topWall
    {
        type            wall;
        faces           ((4 10 11 5));
    }

    sides1_half0
    {
        type            cyclic;
        neighbourPatch  sides1_half1;
        faces           ((0 2 3 1));
    }

    sides1_half1
    {
        type            cyclic;
        neighbourPatch  sides1_half0;
        faces           ((6 7 9 8));
    }

    sides2_half0
    {
        type            cyclic;
        neighbourPatch  sides2_half1;
        faces           ((2 4 5 3));
    }

    sides2_half1
    {
        type            cyclic;
        neighbourPatch  sides2_half0;
        faces           ((8 9 11 10));
    }

    inlet
    {
        type            patch;
        faces           ((0 6 8 2)(2 8 10 4));
    }

    outlet
    {
        type            patch;
        faces           ((1 3 9 7)(3 5 11 9));
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
