ExampleInput/channelFlow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  splitCyclic                           |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            digitalFilter;

        value           $internalField;

        // filter function shape
        // valid options are exponential and gaussian
        // default to exponential
        filterShape     exponential;

        // virtual grid spacing to mesh size ratio
        // should be no smaller than 1
        // default to one
        gridFactor      1;

        // filter width to length scale ratio 
        // should be a positive even bumber no smaller than 8
        // default to 8
        filterFactor    8;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    topWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

    sides1_half0
    {
        type            cyclic;
    }

    sides2_half0
    {
        type            cyclic;
    }

    sides2_half1
    {
        type            cyclic;
    }

    sides1_half1
    {
        type            cyclic;
    }

}

// ************************************************************************* //
